nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_sim.h
/*! @brief Format value for bitfield SIM_SOPT5_LPUART0RXSRC. */
#define BF_SIM_SOPT5_LPUART0RXSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART0RXSRC) & BM_SIM_SOPT5_LPUART0RXSRC)

/*! @brief Set the LPUART0RXSRC field to a new value. */
#define BW_SIM_SOPT5_LPUART0RXSRC(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART0RXSRC), BP_SIM_SOPT5_LPUART0RXSRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field LPUART1TXSRC[5:4] (RW)
 *
 * Selects the source for the LPUART1 transmit data.
 *
 * Values:
 * - 00 - LPUART1_TX pin
 * - 01 - LPUART1_TX pin modulated with TPM1 channel 0 output
 * - 10 - LPUART1_TX pin modulated with TPM2 channel 0 output
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART1TXSRC (4U)     /*!< Bit position for SIM_SOPT5_LPUART1TXSRC. */
#define BM_SIM_SOPT5_LPUART1TXSRC (0x00000030U) /*!< Bit mask for SIM_SOPT5_LPUART1TXSRC. */
#define BS_SIM_SOPT5_LPUART1TXSRC (2U)     /*!< Bit field size in bits for SIM_SOPT5_LPUART1TXSRC. */

/*! @brief Read current value of the SIM_SOPT5_LPUART1TXSRC field. */
#define BR_SIM_SOPT5_LPUART1TXSRC(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_LPUART1TXSRC, BS_SIM_SOPT5_LPUART1TXSRC))

/*! @brief Format value for bitfield SIM_SOPT5_LPUART1TXSRC. */
#define BF_SIM_SOPT5_LPUART1TXSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART1TXSRC) & BM_SIM_SOPT5_LPUART1TXSRC)

/*! @brief Set the LPUART1TXSRC field to a new value. */
#define BW_SIM_SOPT5_LPUART1TXSRC(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART1TXSRC), BP_SIM_SOPT5_LPUART1TXSRC, 2))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field LPUART1RXSRC[6] (RW)
 *
 * Selects the source for the LPUART1 receive data.
 *
 * Values:
 * - 0 - LPUART1_RX pin
 * - 1 - CMP0 output
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART1RXSRC (6U)     /*!< Bit position for SIM_SOPT5_LPUART1RXSRC. */
#define BM_SIM_SOPT5_LPUART1RXSRC (0x00000040U) /*!< Bit mask for SIM_SOPT5_LPUART1RXSRC. */
#define BS_SIM_SOPT5_LPUART1RXSRC (1U)     /*!< Bit field size in bits for SIM_SOPT5_LPUART1RXSRC. */

/*! @brief Read current value of the SIM_SOPT5_LPUART1RXSRC field. */
#define BR_SIM_SOPT5_LPUART1RXSRC(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_LPUART1RXSRC, BS_SIM_SOPT5_LPUART1RXSRC))

/*! @brief Format value for bitfield SIM_SOPT5_LPUART1RXSRC. */
#define BF_SIM_SOPT5_LPUART1RXSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART1RXSRC) & BM_SIM_SOPT5_LPUART1RXSRC)

/*! @brief Set the LPUART1RXSRC field to a new value. */
#define BW_SIM_SOPT5_LPUART1RXSRC(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART1RXSRC), BP_SIM_SOPT5_LPUART1RXSRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field LPUART0ODE[16] (RW)
 *
 * Values:
 * - 0 - Open drain is disabled on LPUART0.
 * - 1 - Open drain is enabled on LPUART0.
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART0ODE (16U)      /*!< Bit position for SIM_SOPT5_LPUART0ODE. */
#define BM_SIM_SOPT5_LPUART0ODE (0x00010000U) /*!< Bit mask for SIM_SOPT5_LPUART0ODE. */
#define BS_SIM_SOPT5_LPUART0ODE (1U)       /*!< Bit field size in bits for SIM_SOPT5_LPUART0ODE. */

/*! @brief Read current value of the SIM_SOPT5_LPUART0ODE field. */
#define BR_SIM_SOPT5_LPUART0ODE(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_LPUART0ODE, BS_SIM_SOPT5_LPUART0ODE))

/*! @brief Format value for bitfield SIM_SOPT5_LPUART0ODE. */
#define BF_SIM_SOPT5_LPUART0ODE(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART0ODE) & BM_SIM_SOPT5_LPUART0ODE)

/*! @brief Set the LPUART0ODE field to a new value. */
#define BW_SIM_SOPT5_LPUART0ODE(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART0ODE), BP_SIM_SOPT5_LPUART0ODE, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field LPUART1ODE[17] (RW)
 *
 * Values:
 * - 0 - Open drain is disabled on LPUART1.
 * - 1 - Open drain is enabled on LPUART1
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART1ODE (17U)      /*!< Bit position for SIM_SOPT5_LPUART1ODE. */
#define BM_SIM_SOPT5_LPUART1ODE (0x00020000U) /*!< Bit mask for SIM_SOPT5_LPUART1ODE. */
#define BS_SIM_SOPT5_LPUART1ODE (1U)       /*!< Bit field size in bits for SIM_SOPT5_LPUART1ODE. */

/*! @brief Read current value of the SIM_SOPT5_LPUART1ODE field. */
#define BR_SIM_SOPT5_LPUART1ODE(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_LPUART1ODE, BS_SIM_SOPT5_LPUART1ODE))

/*! @brief Format value for bitfield SIM_SOPT5_LPUART1ODE. */
#define BF_SIM_SOPT5_LPUART1ODE(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART1ODE) & BM_SIM_SOPT5_LPUART1ODE)

/*! @brief Set the LPUART1ODE field to a new value. */
#define BW_SIM_SOPT5_LPUART1ODE(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART1ODE), BP_SIM_SOPT5_LPUART1ODE, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART2ODE[18] (RW)
 *
 * Values:
 * - 0 - Open drain is disabled on UART2
 * - 1 - Open drain is enabled on UART2
 */
/*@{*/
#define BP_SIM_SOPT5_UART2ODE (18U)        /*!< Bit position for SIM_SOPT5_UART2ODE. */
#define BM_SIM_SOPT5_UART2ODE (0x00040000U) /*!< Bit mask for SIM_SOPT5_UART2ODE. */
#define BS_SIM_SOPT5_UART2ODE (1U)         /*!< Bit field size in bits for SIM_SOPT5_UART2ODE. */

/*! @brief Read current value of the SIM_SOPT5_UART2ODE field. */
#define BR_SIM_SOPT5_UART2ODE(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_UART2ODE, BS_SIM_SOPT5_UART2ODE))

/*! @brief Format value for bitfield SIM_SOPT5_UART2ODE. */
#define BF_SIM_SOPT5_UART2ODE(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_UART2ODE) & BM_SIM_SOPT5_UART2ODE)

/*! @brief Set the UART2ODE field to a new value. */
#define BW_SIM_SOPT5_UART2ODE(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_UART2ODE), BP_SIM_SOPT5_UART2ODE, 1))
/*@}*/

/*******************************************************************************
 * HW_SIM_SOPT7 - System Options Register 7
 ******************************************************************************/

/*!
 * @brief HW_SIM_SOPT7 - System Options Register 7 (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_sim_sopt7
{
    uint32_t U;
    struct _hw_sim_sopt7_bitfields
    {
        uint32_t ADC0TRGSEL : 4;       /*!< [3:0] ADC0 Trigger Select */
        uint32_t ADC0PRETRGSEL : 1;    /*!< [4] ADC0 Pretrigger Select */
        uint32_t RESERVED0 : 2;        /*!< [6:5]  */
        uint32_t ADC0ALTTRGEN : 1;     /*!< [7] ADC0 Alternate Trigger Enable */
        uint32_t RESERVED1 : 24;       /*!< [31:8]  */
    } B;
} hw_sim_sopt7_t;

/*!
 * @name Constants and macros for entire SIM_SOPT7 register
 */
/*@{*/
#define HW_SIM_SOPT7_ADDR(x)     ((x) + 0x1018U)

#define HW_SIM_SOPT7(x)          (*(__IO hw_sim_sopt7_t *) HW_SIM_SOPT7_ADDR(x))
#define HW_SIM_SOPT7_RD(x)       (HW_SIM_SOPT7(x).U)
#define HW_SIM_SOPT7_WR(x, v)    (HW_SIM_SOPT7(x).U = (v))
#define HW_SIM_SOPT7_SET(x, v)   (BME_OR32(HW_SIM_SOPT7_ADDR(x), (uint32_t)(v)))
#define HW_SIM_SOPT7_CLR(x, v)   (BME_AND32(HW_SIM_SOPT7_ADDR(x), (uint32_t)(~(v))))
#define HW_SIM_SOPT7_TOG(x, v)   (BME_XOR32(HW_SIM_SOPT7_ADDR(x), (uint32_t)(v)))
/*@}*/

